{
  "cells": [
    {
      "cell_type": "code",
      "source": [
        "!nvidia-smi\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "m6mDb-OnvEi3",
        "outputId": "37fe0909-8e6d-4049-f26c-4efc669ac2f1"
      },
      "execution_count": 1,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Fri Nov 14 19:44:13 2025       \n",
            "+-----------------------------------------------------------------------------------------+\n",
            "| NVIDIA-SMI 550.54.15              Driver Version: 550.54.15      CUDA Version: 12.4     |\n",
            "|-----------------------------------------+------------------------+----------------------+\n",
            "| GPU  Name                 Persistence-M | Bus-Id          Disp.A | Volatile Uncorr. ECC |\n",
            "| Fan  Temp   Perf          Pwr:Usage/Cap |           Memory-Usage | GPU-Util  Compute M. |\n",
            "|                                         |                        |               MIG M. |\n",
            "|=========================================+========================+======================|\n",
            "|   0  Tesla T4                       Off |   00000000:00:04.0 Off |                    0 |\n",
            "| N/A   49C    P8             10W /   70W |       0MiB /  15360MiB |      0%      Default |\n",
            "|                                         |                        |                  N/A |\n",
            "+-----------------------------------------+------------------------+----------------------+\n",
            "                                                                                         \n",
            "+-----------------------------------------------------------------------------------------+\n",
            "| Processes:                                                                              |\n",
            "|  GPU   GI   CI        PID   Type   Process name                              GPU Memory |\n",
            "|        ID   ID                                                               Usage      |\n",
            "|=========================================================================================|\n",
            "|  No running processes found                                                             |\n",
            "+-----------------------------------------------------------------------------------------+\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!apt-get -y install pciutils >/dev/null\n"
      ],
      "metadata": {
        "id": "7SScLGt-vMu9"
      },
      "execution_count": 2,
      "outputs": []
    },
    {
      "cell_type": "code",
      "execution_count": 3,
      "metadata": {
        "id": "NtG4XRreIFtP",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "99d554e5-b2d3-48b0-a6b4-1a774ba65958"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/2.5 MB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[91m━━━━━━━━━━━━━━━━━━━━━\u001b[0m\u001b[91m╸\u001b[0m\u001b[90m━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m1.4/2.5 MB\u001b[0m \u001b[31m41.6 MB/s\u001b[0m eta \u001b[36m0:00:01\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2.5/2.5 MB\u001b[0m \u001b[31m45.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/325.4 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m325.4/325.4 kB\u001b[0m \u001b[31m31.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/326.6 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m326.6/326.6 kB\u001b[0m \u001b[31m32.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/64.7 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m64.7/64.7 kB\u001b[0m \u001b[31m6.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/50.9 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m50.9/50.9 kB\u001b[0m \u001b[31m5.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[31mERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.\n",
            "google-colab 1.0.0 requires requests==2.32.4, but you have requests 2.32.5 which is incompatible.\u001b[0m\u001b[31m\n",
            "\u001b[0m"
          ]
        }
      ],
      "source": [
        "!pip -q install langchain langchain-community neo4j pypdf pandas\n",
        "\n",
        "import os, time, json, glob, hashlib, requests\n",
        "import pandas as pd\n",
        "from itertools import islice\n",
        "\n",
        "from neo4j import GraphDatabase\n",
        "from langchain_community.document_loaders import PyPDFLoader\n",
        "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
        "from langchain_community.embeddings import OllamaEmbeddings\n",
        "from langchain_community.vectorstores import Neo4jVector\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 4,
      "metadata": {
        "id": "225lAjmbqfi6"
      },
      "outputs": [],
      "source": [
        "NEO4J_URI  = \"bolt://18.206.150.250:7687\"\n",
        "NEO4J_USER = \"neo4j\"\n",
        "NEO4J_PASS = \"bangs-cliffs-lookout\"\n",
        "\n",
        "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USER, NEO4J_PASS))\n",
        "\n",
        "BASE = \"http://127.0.0.1:11434\"\n",
        "LLM_MODEL = \"llama3.1:8b\"\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 5,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "YG0EahgmBgB8",
        "outputId": "3bd5534c-22c3-4bc9-cc50-72e38dda4de7"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "^C\n",
            ">>> Installing ollama to /usr/local\n",
            ">>> Downloading Linux amd64 bundle\n",
            "######################################################################## 100.0%\n",
            ">>> Creating ollama user...\n",
            ">>> Adding ollama user to video group...\n",
            ">>> Adding current user to ollama group...\n",
            ">>> Creating ollama systemd service...\n",
            "\u001b[1m\u001b[31mWARNING:\u001b[m systemd is not running\n",
            ">>> NVIDIA GPU installed.\n",
            ">>> The Ollama API is now available at 127.0.0.1:11434.\n",
            ">>> Install complete. Run \"ollama\" from the command line.\n"
          ]
        }
      ],
      "source": [
        "!pkill -f ollama || true\n",
        "!curl -fsSL https://ollama.com/install.sh | sh\n",
        "\n",
        "import os, subprocess, time, requests\n",
        "os.environ[\"OLLAMA_USE_CUDA\"] = \"1\"\n",
        "\n",
        "# start server\n",
        "p = subprocess.Popen([\"ollama\", \"serve\"])\n",
        "\n",
        "for _ in range(90):\n",
        "    try:\n",
        "        if requests.get(\"http://127.0.0.1:11434/api/version\", timeout=2).ok:\n",
        "            break\n",
        "    except Exception:\n",
        "        pass\n",
        "    time.sleep(1)\n"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "!ollama pull nomic-embed-text\n",
        "!ollama pull llama3.1:8b"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "NEe277xr1sYf",
        "outputId": "129eebd6-a91f-4c74-a984-f3e8b9fdc48e"
      },
      "execution_count": 6,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\n",
            "\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\u001b[?2026h\u001b[?25l\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[A\u001b[1G\u001b[?25h\u001b[?2026l\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 7,
      "metadata": {
        "id": "GNNHglESYCBh",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "135cfcd8-bcef-44bc-889e-ab84b0293510"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Total chunks: 210\n"
          ]
        }
      ],
      "source": [
        "import re, glob, os\n",
        "from langchain_community.document_loaders import PyPDFLoader\n",
        "from langchain_core.documents import Document\n",
        "from langchain_text_splitters import RecursiveCharacterTextSplitter\n",
        "\n",
        "PDF_GLOB = \"/content/pdf_listings2/listing_*.pdf\"\n",
        "pdf_paths = sorted(glob.glob(PDF_GLOB))\n",
        "assert pdf_paths, \"Нема PDF-и во /content/pdf_listings2/\"\n",
        "\n",
        "# 'Линк:' блок преку повеќе редови\n",
        "link_block_re = re.compile(\n",
        "    r\"(Линк:?\\s*)(https?://[^\\s]+(?:\\s+[^\\s]+){0,15})\",\n",
        "    re.IGNORECASE\n",
        ")\n",
        "\n",
        "# fallback за сите http/https линкови\n",
        "raw_url_re = re.compile(\n",
        "    r\"https?://[^\\s]+\",\n",
        "    re.IGNORECASE\n",
        ")\n",
        "\n",
        "def clean_candidate_url(u: str) -> str:\n",
        "    \"\"\"\n",
        "    Чисти URL кандидат од PDF текст.\n",
        "    1. Сече кај зборови како 'Цена', 'Телефон', 'Објавено', 'Агенцијa' итн.\n",
        "    2. Го ограничува на валидни URL карактери.\n",
        "    3. Вади траилинг интерпункција.\n",
        "    \"\"\"\n",
        "    CUT_TOKENS = [\n",
        "        \"цена\", \"Цена\", \"ЦЕНА\",\n",
        "        \"телефон\", \"Телефон\",\n",
        "        \"објавено\", \"Објавено\",\n",
        "        \"оглас\", \"Оглас\",\n",
        "        \"агенција\", \"Агенција\",\n",
        "    ]\n",
        "    for tok in CUT_TOKENS:\n",
        "        idx = u.find(tok)\n",
        "        if idx != -1:\n",
        "            u = u[:idx]\n",
        "\n",
        "    # дозволени карактери во URL\n",
        "    m = re.match(r\"^(https?://[A-Za-z0-9\\-._~/\\d%?&=+#]+)\", u.strip())\n",
        "    if m:\n",
        "        u = m.group(1)\n",
        "\n",
        "    u = u.rstrip(\").,;\")\n",
        "    return u.strip()\n",
        "\n",
        "def pick_best_pazar3_link(all_urls):\n",
        "    \"\"\"\n",
        "    Од листа кандидати избери најверојатно вистински линк кон оглас:\n",
        "    - мора да содржи 'pazar3.mk' и '/oglas/'\n",
        "    - ако има повеќе, земи го најдолгиот\n",
        "    \"\"\"\n",
        "    pazar3 = [\n",
        "        u for u in all_urls\n",
        "        if \"pazar3.mk\" in u.lower() and \"/oglas/\" in u.lower()\n",
        "    ]\n",
        "    if not pazar3:\n",
        "        return None\n",
        "    pazar3.sort(key=len, reverse=True)\n",
        "    return pazar3[0]\n",
        "\n",
        "def extract_source_url_from_pdf_text(text: str) -> str | None:\n",
        "    \"\"\"\n",
        "    1. Пробај преку 'Линк:' блок (full URL и ако е прекршен низ редови).\n",
        "    2. Ако не успее, fallback: сите https://... во текстот.\n",
        "    3. Исчисти ги кандидатите и избери најрелевантен pazar3.mk оглас линк.\n",
        "    \"\"\"\n",
        "    candidates = []\n",
        "\n",
        "    # 1) 'Линк:' блок\n",
        "    m = link_block_re.search(text)\n",
        "    if m:\n",
        "        raw_block = m.group(2)\n",
        "        pieces = raw_block.strip().split()\n",
        "        glued = \"\".join(pieces)\n",
        "        candidates.append(clean_candidate_url(glued))\n",
        "\n",
        "    # 2) fallback: сите https... во flatten-нат текст\n",
        "    flat_text = text.replace(\"\\n\", \" \")\n",
        "    for match in raw_url_re.findall(flat_text):\n",
        "        candidates.append(clean_candidate_url(match))\n",
        "\n",
        "    # 3) најдобар pazar3 линк\n",
        "    best = pick_best_pazar3_link(candidates)\n",
        "    return best\n",
        "\n",
        "raw_docs = []\n",
        "for p in pdf_paths:\n",
        "    loader = PyPDFLoader(p)\n",
        "    doc_id = os.path.splitext(os.path.basename(p))[0]\n",
        "\n",
        "    for page in loader.load():\n",
        "        text = page.page_content or \"\"\n",
        "        meta = dict(page.metadata or {})\n",
        "        meta[\"source_pdf\"] = p\n",
        "        meta[\"doc_id\"] = doc_id\n",
        "\n",
        "        # извлечен линк кон огласот\n",
        "        found_url = extract_source_url_from_pdf_text(text)\n",
        "        if found_url:\n",
        "            meta[\"source_url\"] = found_url\n",
        "\n",
        "        # координати (ако постојат)\n",
        "        m_c = re.search(r\"([0-9]+\\.[0-9]+)[,\\s]+([0-9]+\\.[0-9]+)\", text)\n",
        "        if m_c:\n",
        "            meta[\"lat\"] = float(m_c.group(1))\n",
        "            meta[\"lon\"] = float(m_c.group(2))\n",
        "\n",
        "        raw_docs.append(Document(page_content=text, metadata=meta))\n",
        "\n",
        "splitter = RecursiveCharacterTextSplitter(chunk_size=1500, chunk_overlap=150)\n",
        "chunks = splitter.split_documents(raw_docs)\n",
        "print(\"Total chunks:\", len(chunks))\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 8,
      "metadata": {
        "id": "imzmKyILZN4N"
      },
      "outputs": [],
      "source": [
        "with driver.session() as s:\n",
        "    s.run(\"\"\"\n",
        "    CREATE VECTOR INDEX chunk_embed_p3 IF NOT EXISTS\n",
        "    FOR (n:ChunkP3) ON (n.embedding)\n",
        "    OPTIONS { indexConfig: { `vector.dimensions`: 768, `vector.similarity_function`: 'cosine' } }\n",
        "    \"\"\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 9,
      "metadata": {
        "id": "CoLQtxKSZC_D",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "6ead010e-6db2-4ed7-8c5f-0c71c851ca6b"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "/tmp/ipython-input-2120625780.py:5: LangChainDeprecationWarning: The class `OllamaEmbeddings` was deprecated in LangChain 0.3.1 and will be removed in 1.0.0. An updated version of the class exists in the :class:`~langchain-ollama package and should be used instead. To use it run `pip install -U :class:`~langchain-ollama` and import as `from :class:`~langchain_ollama import OllamaEmbeddings``.\n",
            "  emb = OllamaEmbeddings(model=\"nomic-embed-text\", base_url=\"http://127.0.0.1:11434\")\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Ingested: 210\n"
          ]
        }
      ],
      "source": [
        "from langchain_community.embeddings import OllamaEmbeddings\n",
        "from langchain_community.vectorstores import Neo4jVector\n",
        "from itertools import islice\n",
        "\n",
        "emb = OllamaEmbeddings(model=\"nomic-embed-text\", base_url=\"http://127.0.0.1:11434\")\n",
        "_ = emb.embed_query(\"test\")\n",
        "\n",
        "store = Neo4jVector.from_documents(\n",
        "    documents=[], embedding=emb,\n",
        "    url=NEO4J_URI, username=NEO4J_USER, password=NEO4J_PASS,\n",
        "    node_label=\"ChunkP3\",\n",
        "    text_node_property=\"text\",\n",
        "    embedding_node_property=\"embedding\",\n",
        "    index_name=\"chunk_embed_p3\"\n",
        ")\n",
        "\n",
        "def batched(it, n):\n",
        "    it = iter(it)\n",
        "    while True:\n",
        "        b = list(islice(it, n))\n",
        "        if not b: break\n",
        "        yield b\n",
        "\n",
        "ing = 0\n",
        "for b in batched(chunks, 512):\n",
        "    store.add_documents(b)\n",
        "    ing += len(b)\n",
        "    print(\"Ingested:\", ing)\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 10,
      "metadata": {
        "id": "VmucyPrZZnGQ"
      },
      "outputs": [],
      "source": [
        "with driver.session() as s:\n",
        "    s.run(\"MATCH (c:ChunkP3) WHERE c.chunkId IS NULL SET c.chunkId = elementId(c)\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 11,
      "metadata": {
        "id": "X-Yt8L_7Zn--"
      },
      "outputs": [],
      "source": [
        "from neo4j import GraphDatabase\n",
        "\n",
        "with driver.session() as s:\n",
        "    s.run(\"CREATE INDEX listing_uid   IF NOT EXISTS FOR (l:Listing)  ON (l.uid)\")\n",
        "    s.run(\"CREATE INDEX location_name IF NOT EXISTS FOR (n:Location) ON (n.name)\")\n",
        "    s.run(\"CREATE INDEX agent_name    IF NOT EXISTS FOR (a:Agent)    ON (a.name)\")\n",
        "    s.run(\"CREATE INDEX feature_name  IF NOT EXISTS FOR (f:Feature)  ON (f.name)\")\n"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "with driver.session() as s:\n",
        "    idx = s.run(\"SHOW INDEXES YIELD name, type, entityType, state RETURN name, type, entityType, state\").data()\n",
        "idx\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Yvs5EBPgPv0l",
        "outputId": "8918c72b-1bb2-43ab-8ea6-8499bea3e029"
      },
      "execution_count": 12,
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "[{'name': 'agent_name',\n",
              "  'type': 'RANGE',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'chunk_embed_p3',\n",
              "  'type': 'VECTOR',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'constraint_20c300d7',\n",
              "  'type': 'RANGE',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'feature_name',\n",
              "  'type': 'RANGE',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'index_343aff4e',\n",
              "  'type': 'LOOKUP',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'index_f7700477',\n",
              "  'type': 'LOOKUP',\n",
              "  'entityType': 'RELATIONSHIP',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'listing_uid',\n",
              "  'type': 'RANGE',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'},\n",
              " {'name': 'location_name',\n",
              "  'type': 'RANGE',\n",
              "  'entityType': 'NODE',\n",
              "  'state': 'ONLINE'}]"
            ]
          },
          "metadata": {},
          "execution_count": 12
        }
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 13,
      "metadata": {
        "id": "-d-jMGn2ZrAm"
      },
      "outputs": [],
      "source": [
        "INSTR = \"\"\"You are an IE engine. Extract a structured graph from REAL-ESTATE LISTING text.\n",
        "Return STRICT JSON only:\n",
        "{\n",
        "  \"listing\": {\n",
        "    \"uid\": \"<string|null>\",\n",
        "    \"title\": \"<string|null>\",\n",
        "    \"listing_type\": \"<izdavanje|prodazba|unknown|null>\",\n",
        "    \"property_type\": \"<stan|kukja|vikendica|posloven_prostor|drugo|null>\",\n",
        "    \"price_eur\": <number|null>,\n",
        "    \"price_period\": \"<per_month|per_m2|total|unknown|null>\",\n",
        "    \"area_m2\": <number|null>,\n",
        "    \"rooms\": <number|null>,\n",
        "    \"features\": [\"<feature>\", ...],\n",
        "    \"url\": \"<string|null>\",\n",
        "    \"source\": \"<string|null>\"\n",
        "  },\n",
        "  \"location\": { \"name\": \"<string|null>\", \"lat\": <number|null>, \"lon\": <number|null> },\n",
        "  \"agent\": { \"name\": \"<string|null>\", \"phone\": \"<string|null>\" }\n",
        "}\n",
        "Rules:\n",
        "- Detect listing_type (izdavanje vs prodazba) from text/URL:\n",
        "  - if text contains 'издавање', 'се издава', 'изнајмување' → 'izdavanje'\n",
        "  - if text contains 'продажба', 'се продава' → 'prodazba'\n",
        "  - else 'unknown'\n",
        "- Detect property_type:\n",
        "  - if advert is for flat/apartment/стан → 'stan'\n",
        "  - if for house/villa/куќа → 'kukja'\n",
        "  - if weekend house → 'vikendica'\n",
        "  - if office/business/посл. простор → 'posloven_prostor'\n",
        "  - else 'drugo'\n",
        "- Detect price period (per_month vs per_m2 vs total). Missing -> unknown.\n",
        "- If a URL is present, set listing.url.\n",
        "- If coordinates appear, set location.lat/lon numeric.\n",
        "- 'features' should include attributes typically under sections like 'За живеалиштето',\n",
        "  e.g. 'Балкон / Тераса', 'Паркинг простор / Гаража', 'Нова градба', 'Лифт', etc.\n",
        "- Only JSON, no extra text.\"\"\"\n",
        "\n",
        "import os, re, json, time, hashlib, requests, subprocess\n",
        "\n",
        "BASE = \"http://127.0.0.1:11434\"\n",
        "LLM_MODEL_IE = \"llama3.1:8b\"\n",
        "\n",
        "def _ensure_ollama_up(timeout=90):\n",
        "    for _ in range(timeout):\n",
        "        try:\n",
        "            if requests.get(f\"{BASE}/api/version\", timeout=2).ok:\n",
        "                return True\n",
        "        except Exception:\n",
        "            pass\n",
        "        time.sleep(1)\n",
        "    return False\n",
        "\n",
        "def _restart_ollama():\n",
        "    try: subprocess.run([\"pkill\",\"-f\",\"ollama\"], check=False)\n",
        "    except Exception: pass\n",
        "    os.environ.pop(\"OLLAMA_USE_CUDA\", None)\n",
        "    subprocess.Popen([\"ollama\",\"serve\"])\n",
        "    if not _ensure_ollama_up():\n",
        "        raise RuntimeError(\"Ollama did not start\")\n",
        "\n",
        "# ---------- small regex heuristics ----------\n",
        "_price_eur_re     = re.compile(r\"(\\d{1,3}(?:[.\\s]\\d{3})*|\\d+)\\s*(?:€|ЕУР|EUR)(?:\\s*/\\s*(?:месец|month|mo))?\", re.I)\n",
        "_price_per_m2_re  = re.compile(r\"(\\d{1,3}(?:[.\\s]\\d{3})*|\\d+)\\s*(?:€|ЕУР|EUR)\\s*/\\s*(?:m2|м2|м²|sqm)\", re.I)\n",
        "_area_m2_re       = re.compile(r\"(\\d{1,3}(?:[.\\s]\\d{3})*|\\d+)\\s*(?:m2|м2|м²|sqm)\", re.I)\n",
        "_rooms_re         = re.compile(r\"\\b(\\d+)\\s*(?:rooms?|соби|спални)\\b\", re.I)\n",
        "_phone_re         = re.compile(r\"(?:\\+?\\d[\\d\\s\\-\\/]{6,}\\d)\")\n",
        "\n",
        "def _to_num(s):\n",
        "    if s is None: return None\n",
        "    return int(re.sub(r\"[^\\d]\", \"\", s))\n",
        "\n",
        "def heuristic_extract(text, meta):\n",
        "    out = {\n",
        "        \"listing\": {\n",
        "            \"uid\": None,\n",
        "            \"title\": None,\n",
        "            \"listing_type\": None,\n",
        "            \"property_type\": None,\n",
        "            \"price_eur\": None,\n",
        "            \"price_period\": None,\n",
        "            \"area_m2\": None,\n",
        "            \"rooms\": None,\n",
        "            \"features\": [],\n",
        "            \"url\": None,\n",
        "            \"source\": None\n",
        "        },\n",
        "        \"location\": {\"name\": None, \"lat\": None, \"lon\": None},\n",
        "        \"agent\": {\"name\": None, \"phone\": None}\n",
        "    }\n",
        "    t = \" \".join((text or \"\").split())\n",
        "    if meta:\n",
        "        out[\"listing\"][\"url\"] = meta.get(\"source_url\") or None\n",
        "        if meta.get(\"lat\") is not None and meta.get(\"lon\") is not None:\n",
        "            out[\"location\"][\"lat\"] = meta[\"lat\"]; out[\"location\"][\"lon\"] = meta[\"lon\"]\n",
        "\n",
        "    # цена / пер м2\n",
        "    m = _price_per_m2_re.search(t)\n",
        "    if m:\n",
        "        out[\"listing\"][\"price_eur\"] = _to_num(m.group(1))\n",
        "        out[\"listing\"][\"price_period\"] = \"per_m2\"\n",
        "    else:\n",
        "        m = _price_eur_re.search(t)\n",
        "        if m:\n",
        "            out[\"listing\"][\"price_eur\"] = _to_num(m.group(1))\n",
        "            out[\"listing\"][\"price_period\"] = \"per_month\" if any(k in t.lower() for k in [\"мес\", \"/ мес\", \"month\", \"/mo\"]) else \"total\"\n",
        "\n",
        "    # површина\n",
        "    m = _area_m2_re.search(t)\n",
        "    if m: out[\"listing\"][\"area_m2\"] = _to_num(m.group(1))\n",
        "\n",
        "    # соби\n",
        "    m = _rooms_re.search(t)\n",
        "    if m:\n",
        "        try: out[\"listing\"][\"rooms\"] = int(m.group(1))\n",
        "        except: pass\n",
        "\n",
        "    # телефон\n",
        "    m = _phone_re.search(t)\n",
        "    if m: out[\"agent\"][\"phone\"] = m.group(0)\n",
        "\n",
        "    # груба евруација\n",
        "    score = sum(v is not None for v in [\n",
        "        out[\"listing\"][\"price_eur\"], out[\"listing\"][\"area_m2\"],\n",
        "        out[\"listing\"][\"price_period\"], out[\"listing\"][\"url\"]\n",
        "    ])\n",
        "    return out, score\n",
        "\n",
        "def _json_mode_stream(prompt_obj):\n",
        "    r = requests.post(f\"{BASE}/api/generate\", json={\n",
        "        \"model\": LLM_MODEL_IE,\n",
        "        \"prompt\": json.dumps(prompt_obj),\n",
        "        \"format\": \"json\",\n",
        "        \"stream\": True,\n",
        "        \"keep_alive\": \"30m\",\n",
        "        \"options\": {\"temperature\": 0.1, \"num_predict\": 180},\n",
        "    }, stream=True, timeout=(10, 610))\n",
        "    r.raise_for_status()\n",
        "    buf=[]\n",
        "    for line in r.iter_lines(decode_unicode=True):\n",
        "        if not line: continue\n",
        "        try:\n",
        "            obj = json.loads(line)\n",
        "            if \"response\" in obj: buf.append(obj[\"response\"])\n",
        "        except json.JSONDecodeError:\n",
        "            continue\n",
        "    return json.loads(\"\".join(buf).strip())\n",
        "\n",
        "def _json_mode_nostream(prompt_obj):\n",
        "    r = requests.post(f\"{BASE}/api/generate\", json={\n",
        "        \"model\": LLM_MODEL_IE,\n",
        "        \"prompt\": json.dumps(prompt_obj),\n",
        "        \"format\": \"json\",\n",
        "        \"stream\": False,\n",
        "        \"keep_alive\": \"30m\",\n",
        "        \"options\": {\"temperature\": 0.1, \"num_predict\": 180},\n",
        "    }, timeout=600)\n",
        "    r.raise_for_status()\n",
        "    return json.loads(r.json().get(\"response\",\"\").strip())\n",
        "\n",
        "def _plain_mode_brace(prompt_text):\n",
        "    r = requests.post(f\"{BASE}/api/generate\", json={\n",
        "        \"model\": LLM_MODEL_IE,\n",
        "        \"prompt\": prompt_text,\n",
        "        \"stream\": False,\n",
        "        \"keep_alive\": \"30m\",\n",
        "        \"options\": {\"temperature\": 0.1, \"num_predict\": 200},\n",
        "        \"stop\": [\"\\n\\n\", \"```\", \"\\nJSON\", \"\\nText:\"]\n",
        "    }, timeout=600)\n",
        "    r.raise_for_status()\n",
        "    raw = r.json().get(\"response\",\"\").strip()\n",
        "    b, e = raw.find(\"{\"), raw.rfind(\"}\")\n",
        "    if b != -1 and e != -1:\n",
        "        return json.loads(raw[b:e+1])\n",
        "    raise ValueError(\"no JSON braces found\")\n",
        "\n",
        "def ollama_generate_json_ie(text, meta=None, max_retries=2):\n",
        "    if not _ensure_ollama_up(): _restart_ollama()\n",
        "\n",
        "    hints = []\n",
        "    if meta:\n",
        "        if meta.get(\"source_url\"): hints.append({\"hint\":\"url\",\"value\": meta[\"source_url\"]})\n",
        "        if meta.get(\"lat\") is not None and meta.get(\"lon\") is not None:\n",
        "            hints.append({\"hint\":\"coords\",\"value\": f'{meta[\"lat\"]},{meta[\"lon\"]}'})\n",
        "    body = \" \".join((text or \"\").split())[:2800]\n",
        "\n",
        "    instr = {\n",
        "        \"instruction\": \"Extract structured real-estate info as JSON only.\",\n",
        "        \"schema\": {\n",
        "            \"listing\": {\n",
        "                \"uid\": \"string|null\",\n",
        "                \"title\": \"string|null\",\n",
        "                \"listing_type\": \"izdavanje|prodazba|unknown|null\",\n",
        "                \"property_type\": \"stan|kukja|vikendica|posloven_prostor|drugo|null\",\n",
        "                \"price_eur\": \"number|null\",\n",
        "                \"price_period\": \"per_month|per_m2|total|unknown|null\",\n",
        "                \"area_m2\": \"number|null\",\n",
        "                \"rooms\": \"number|null\",\n",
        "                \"features\": [\"string\"],\n",
        "                \"url\": \"string|null\",\n",
        "                \"source\": \"string|null\"\n",
        "            },\n",
        "            \"location\": { \"name\":\"string|null\", \"lat\":\"number|null\", \"lon\":\"number|null\" },\n",
        "            \"agent\": { \"name\":\"string|null\", \"phone\":\"string|null\" }\n",
        "        },\n",
        "        \"rules\": [\n",
        "            \"Return ONLY valid JSON (no prose).\",\n",
        "            \"If €/m² -> price_period=per_m2; if monthly -> per_month; else total/unknown.\",\n",
        "            \"Detect listing_type and property_type from Macedonian words in the text/URL.\"\n",
        "        ],\n",
        "        \"hints\": hints\n",
        "    }\n",
        "    prompt_obj = {\"schema\":\"listing_ie_v2\",\"instr\":instr,\"text\":body}\n",
        "\n",
        "    # 0) heuristic fast-path\n",
        "    hjson, score = heuristic_extract(text, meta)\n",
        "    if score >= 2:\n",
        "        return hjson\n",
        "\n",
        "    # 1) JSON mode (stream)\n",
        "    for _ in range(max_retries):\n",
        "        try:\n",
        "            return _json_mode_stream(prompt_obj)\n",
        "        except (requests.exceptions.ReadTimeout, json.JSONDecodeError, requests.exceptions.ConnectionError):\n",
        "            time.sleep(0.6)\n",
        "\n",
        "    # 2) JSON mode (no stream)\n",
        "    try:\n",
        "        return _json_mode_nostream(prompt_obj)\n",
        "    except Exception:\n",
        "        pass\n",
        "\n",
        "    # 3) Plain text with brace parse\n",
        "    try:\n",
        "        return _plain_mode_brace(f\"{INSTR}\\n\\nTEXT:\\n{body}\\n\\nJSON:\")\n",
        "    except Exception:\n",
        "        pass\n",
        "\n",
        "    # 4) Last-resort: fallback на heuristic JSON за да не заглави pipeline-от\n",
        "    return {\n",
        "        \"listing\": {\n",
        "            \"uid\": None,\n",
        "            \"title\": None,\n",
        "            \"listing_type\": hjson[\"listing\"].get(\"listing_type\"),\n",
        "            \"property_type\": hjson[\"listing\"].get(\"property_type\"),\n",
        "            \"price_eur\": hjson[\"listing\"][\"price_eur\"],\n",
        "            \"price_period\": hjson[\"listing\"][\"price_period\"],\n",
        "            \"area_m2\": hjson[\"listing\"][\"area_m2\"],\n",
        "            \"rooms\": hjson[\"listing\"][\"rooms\"],\n",
        "            \"features\": hjson[\"listing\"][\"features\"],\n",
        "            \"url\": hjson[\"listing\"][\"url\"],\n",
        "            \"source\": meta.get(\"source_pdf\") if meta else None\n",
        "        },\n",
        "        \"location\": hjson[\"location\"],\n",
        "        \"agent\": hjson[\"agent\"]\n",
        "    }\n",
        "\n",
        "# ---- IE + UPSERT на партија ----\n",
        "def extract_and_upsert_p3(items, batch_size=8):\n",
        "    rows, done, total = [], 0, len(items)\n",
        "    t0 = time.time()\n",
        "    with driver.session() as s:\n",
        "        for it in items:\n",
        "            txt = (it[\"text\"] or \"\").strip()\n",
        "            if len(txt) < 40:\n",
        "                s.run(\"MATCH (c:ChunkP3 {chunkId:$id}) SET c.extracted=true, c.extractedAt=timestamp()\", id=it[\"chunkId\"])\n",
        "                done += 1\n",
        "                continue\n",
        "\n",
        "            data = ollama_generate_json_ie(txt, meta=it.get(\"meta\"))\n",
        "\n",
        "            meta_url = (it.get(\"meta\") or {}).get(\"source_url\")\n",
        "            llm_url  = (data.get(\"listing\") or {}).get(\"url\")\n",
        "\n",
        "            final_url = llm_url or meta_url\n",
        "\n",
        "            listing = (data.get(\"listing\") or {})\n",
        "            location = (data.get(\"location\") or {})\n",
        "            agent = (data.get(\"agent\") or {})\n",
        "\n",
        "            rows.append({\n",
        "                \"chunkId\": it[\"chunkId\"],\n",
        "                \"hash\": hashlib.sha1(txt.encode(\"utf-8\")).hexdigest()[:16],\n",
        "                \"listing\": {\n",
        "                    \"uid\":           listing.get(\"uid\"),\n",
        "                    \"title\":         listing.get(\"title\"),\n",
        "                    \"listing_type\":  listing.get(\"listing_type\"),\n",
        "                    \"property_type\": listing.get(\"property_type\"),\n",
        "                    \"price_eur\":     listing.get(\"price_eur\"),\n",
        "                    \"price_period\":  listing.get(\"price_period\"),\n",
        "                    \"area_m2\":       listing.get(\"area_m2\"),\n",
        "                    \"rooms\":         listing.get(\"rooms\"),\n",
        "                    \"features\":      listing.get(\"features\"),\n",
        "                    \"source\":        listing.get(\"source\"),\n",
        "                    \"url\":           final_url,\n",
        "                },\n",
        "                \"location\": {\n",
        "                    \"name\": location.get(\"name\"),\n",
        "                    \"lat\":  location.get(\"lat\"),\n",
        "                    \"lon\":  location.get(\"lon\"),\n",
        "                },\n",
        "                \"agent\": {\n",
        "                    \"name\":  agent.get(\"name\"),\n",
        "                    \"phone\": agent.get(\"phone\"),\n",
        "                },\n",
        "                \"chunk_url\": meta_url\n",
        "            })\n",
        "\n",
        "            print(\"DEBUG ROW:\",\n",
        "                it[\"chunkId\"],\n",
        "                \"final_url=\", final_url,\n",
        "                \"meta_url=\", meta_url,\n",
        "                \"llm_url=\", listing.get(\"url\"))\n",
        "\n",
        "            if len(rows) >= batch_size:\n",
        "                s.run(CYPHER_UPSERT, rows=rows)\n",
        "                done += len(rows); rows=[]\n",
        "                print(f\"Upsert: {done}/{total}\")\n",
        "\n",
        "        if rows:\n",
        "            s.run(CYPHER_UPSERT, rows=rows)\n",
        "            done += len(rows)\n",
        "            print(f\"Upsert: {done}/{total} (final)\")\n",
        "\n",
        "    print(\"Graph upsert time:\", round(time.time()-t0, 2), \"s\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 14,
      "metadata": {
        "id": "EMQcnbrOZ-oA"
      },
      "outputs": [],
      "source": [
        "def fetch_chunks_p3(limit=None):\n",
        "    q = \"\"\"\n",
        "    MATCH (c:ChunkP3)\n",
        "    WHERE c.extracted IS NULL OR c.extracted = false\n",
        "    RETURN c.chunkId AS id, c.text AS text, c AS node\n",
        "    \"\"\"\n",
        "    if limit: q += \" LIMIT $lim\"\n",
        "    with driver.session() as s:\n",
        "        rows = s.run(q, lim=limit).data() if limit else s.run(q).data()\n",
        "    out = []\n",
        "    for r in rows:\n",
        "        node_props = dict(r[\"node\"])\n",
        "        meta = {k: node_props.get(k) for k in (\"source_url\",\"source_pdf\",\"lat\",\"lon\")}\n",
        "        out.append({\"chunkId\": r[\"id\"], \"text\": r[\"text\"], \"meta\": meta})\n",
        "    return out\n",
        "\n",
        "CYPHER_UPSERT = \"\"\"\n",
        "UNWIND $rows AS r\n",
        "\n",
        "// 1) најди го chunk-от и сетирај му ги основните проперти\n",
        "MATCH (c:ChunkP3 {chunkId: r.chunkId})\n",
        "SET c.url         = coalesce(c.url, r.chunk_url),\n",
        "    c.extracted   = true,\n",
        "    c.extractedAt = timestamp()\n",
        "\n",
        "// 2) upsert Listing\n",
        "MERGE (l:Listing {uid: coalesce(r.listing.uid, r.hash)})\n",
        "SET l.title         = coalesce(r.listing.title, l.title),\n",
        "    l.listing_type  = coalesce(r.listing.listing_type, l.listing_type),\n",
        "    l.property_type = coalesce(r.listing.property_type, l.property_type),\n",
        "    l.price_eur     = coalesce(r.listing.price_eur, l.price_eur),\n",
        "    l.price_period  = coalesce(r.listing.price_period, l.price_period),\n",
        "    l.area_m2       = coalesce(r.listing.area_m2, l.area_m2),\n",
        "    l.rooms         = coalesce(r.listing.rooms, l.rooms),\n",
        "    l.source        = coalesce(r.listing.source, l.source),\n",
        "    l.url           = coalesce(r.listing.url, l.url, r.chunk_url)  // <- ова е клучно\n",
        "\n",
        "WITH r, l, c\n",
        "FOREACH (_ IN CASE WHEN r.location.name IS NULL THEN [] ELSE [1] END |\n",
        "  MERGE (loc:Location {name: r.location.name})\n",
        "  SET loc.lat = coalesce(r.location.lat, loc.lat),\n",
        "      loc.lon = coalesce(r.location.lon, loc.lon)\n",
        "  MERGE (l)-[:LOCATED_IN]->(loc)\n",
        ")\n",
        "\n",
        "WITH r, l, c\n",
        "FOREACH (_ IN CASE WHEN r.agent.name IS NULL AND r.agent.phone IS NULL THEN [] ELSE [1] END |\n",
        "  MERGE (a:Agent {name: coalesce(r.agent.name, r.agent.phone)})\n",
        "  SET a.phone = coalesce(r.agent.phone, a.phone)\n",
        "  MERGE (l)-[:LISTED_BY]->(a)\n",
        ")\n",
        "\n",
        "WITH r, l, c\n",
        "FOREACH (f IN coalesce(r.listing.features, []) |\n",
        "  MERGE (feat:Feature {name: f})\n",
        "  MERGE (l)-[:HAS_FEATURE]->(feat)\n",
        ")\n",
        "\n",
        "// 3) поврзи listing ↔ chunk\n",
        "MERGE (l)-[:MENTIONED_IN]->(c)\n",
        "\"\"\"\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 16,
      "metadata": {
        "id": "stVOnva9Z_FO",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "afe97ba9-9f25-4888-d9eb-f9602b1b58d1"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "[{'n': 75}]\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:120 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/imperi meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/imperi llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/imperi\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:121 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/imperija-nedviznosti-kuka-od-190m2/1467274 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/imperija-nedviznosti-kuka-od-190m2/1467274 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/imperija-nedviznosti-kuka-od-190m2/1467274\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:122 final_url= https://www.facebook.com/p/100063740252463/?_rdr meta_url= None llm_url= https://www.facebook.com/p/100063740252463/?_rdr\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:123 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/kavadarci/kavadarci-opstina/se-prodava-kukja-na-tikvesko-ezero/8091588 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/kavadarci/kavadarci-opstina/se-prodava-kukja-na-tikvesko-ezero/8091588 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/kavadarci/kavadarci-opstina/se-prodava-kukja-na-tikvesko-ezero/8091588\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:124 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/berovo/se-prodava-kukja-vo-berovo/8091586 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/berovo/se-prodava-kukja-vo-berovo/8091586 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/berovo/se-prodava-kukja-vo-berovo/8091586\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:125 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/berovo/se-prodava-kukja-vo-berovo/8091586 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/berovo/se-prodava-kukja-vo-berovo/8091586 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/berovo/se-prodava-kukja-vo-berovo/8091586\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:126 final_url= https://pazar3.mk/DoraInvest meta_url= None llm_url= https://pazar3.mk/DoraInvest\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:127 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/stip/stip-opstina/se-prodava-kukja-vo-stip/8091579 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/stip/stip-opstina/se-prodava-kukja-vo-stip/8091579 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/stip/stip-opstina/se-prodava-kukja-vo-stip/8091579\n",
            "Upsert: 8/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:128 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/agenczi meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/agenczi llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/agenczi\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:129 final_url= https:/// meta_url= None llm_url= https:///\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:130 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/centar/vodno-kapistec-320m2-individualen-stanben-objekt/7846105 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/centar/vodno-kapistec-320m2-individualen-stanben-objekt/7846105 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/centar/vodno-kapistec-320m2-individualen-stanben-objekt/7846105\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:131 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:132 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/kisela-voda/se-prodava-kuka-vo-11-oktomvri-k-voda/7910181 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/kisela-voda/se-prodava-kuka-vo-11-oktomvri-k-voda/7910181 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/kisela-voda/se-prodava-kuka-vo-11-oktomvri-k-voda/7910181\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:134 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/aerodrom/se-prodava-stan-aerodrom-82m/8092167 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/aerodrom/se-prodava-stan-aerodrom-82m/8092167 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/aerodrom/se-prodava-stan-aerodrom-82m/8092167\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:135 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:136 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gazi-baba/se-prodava-kuka-vo-jurumleri/7276841 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gazi-baba/se-prodava-kuka-vo-jurumleri/7276841 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gazi-baba/se-prodava-kuka-vo-jurumleri/7276841\n",
            "Upsert: 17/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:137 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:138 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/kisela-voda/imame-potrba-od-kuki-i-placzevi-vo-skop meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/kisela-voda/imame-potrba-od-kuki-i-placzevi-vo-skop llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/kisela-voda/imame-potrba-od-kuki-i-placzevi-vo-skop\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:139 final_url= https://bit.ly/48gXc9p meta_url= None llm_url= https://bit.ly/48gXc9p\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:140 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/aerodrom/hit-samostojna-ponova-kukja-vo-lisice/5574586 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/aerodrom/hit-samostojna-ponova-kukja-vo-lisice/5574586 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/aerodrom/hit-samostojna-ponova-kukja-vo-lisice/5574586\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:141 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:142 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gorce-petrov/se-prodava-ekskluzivna-kukja-vo-volkovo/7340023 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gorce-petrov/se-prodava-ekskluzivna-kukja-vo-volkovo/7340023 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gorce-petrov/se-prodava-ekskluzivna-kukja-vo-volkovo/7340023\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:143 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:144 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/villa-so-8-apartmani-na-kejot-na-ohridskoto-ezero/4761849 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/villa-so-8-apartmani-na-kejot-na-ohridskoto-ezero/4761849 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/villa-so-8-apartmani-na-kejot-na-ohridskoto-ezero/4761849\n",
            "Upsert: 25/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:145 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:146 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gazi-baba/kuka-so-dvor-vo-nova-kolonija/7254138 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gazi-baba/kuka-so-dvor-vo-nova-kolonija/7254138 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/gazi-baba/kuka-so-dvor-vo-nova-kolonija/7254138\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:147 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:148 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/tetovo/tetovo-opstina/airealestate-prodava-dve-kuqi-so-dvor-vo-centar/8091284 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/tetovo/tetovo-opstina/airealestate-prodava-dve-kuqi-so-dvor-vo-centar/8091284 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/tetovo/tetovo-opstina/airealestate-prodava-dve-kuqi-so-dvor-vo-centar/8091284\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:149 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:150 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-izdava-mnogu-ubav-stan-univerzalna-70m2/6205868 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-izdava-mnogu-ubav-stan-univerzalna-70m2/6205868 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-izdava-mnogu-ubav-stan-univerzalna-70m2/6205868\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:151 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/namesten-stan-50m2-do-medicinski-fakultet/4800686 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/namesten-stan-50m2-do-medicinski-fakultet/4800686 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/namesten-stan-50m2-do-medicinski-fakultet/4800686\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:152 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/centar/se-prodava-stan-kapistec/8080146 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/centar/se-prodava-stan-kapistec/8080146 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/centar/se-prodava-stan-kapistec/8080146\n",
            "Upsert: 33/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:153 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/karpos/se-izdava-stan-vo-taftalidze/8092166 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/karpos/se-izdava-stan-vo-taftalidze/8092166 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/karpos/se-izdava-stan-vo-taftalidze/8092166\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:154 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-kaj-vero-dzambo/7338259 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-kaj-vero-dzambo/7338259 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-kaj-vero-dzambo/7338259\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:155 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-kisela-voda/8077370 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-kisela-voda/8077370 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-kisela-voda/8077370\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:156 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-pozadi-univerzalna-sala-55m2/7878708 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-pozadi-univerzalna-sala-55m2/7878708 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-pozadi-univerzalna-sala-55m2/7878708\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:157 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-vo-kisela-voda/8092134 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-vo-kisela-voda/8092134 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-vo-kisela-voda/8092134\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:158 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-vo-aerodrom/8080137 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-vo-aerodrom/8080137 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-vo-aerodrom/8080137\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:159 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-vo-aerodrom/8092140 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-vo-aerodrom/8092140 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-vo-aerodrom/8092140\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:160 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-centar/8092130 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-centar/8092130 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-centar/8092130\n",
            "Upsert: 41/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:161 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-trosoben-stan-aerodrom/8092124 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-trosoben-stan-aerodrom/8092124 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-trosoben-stan-aerodrom/8092124\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:162 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/aerodrom/se-iznajmuva-lux-namesten-stan-so-tri-spalni-aerodrom/2143835 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/aerodrom/se-iznajmuva-lux-namesten-stan-so-tri-spalni-aerodrom/2143835 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/aerodrom/se-iznajmuva-lux-namesten-stan-so-tri-spalni-aerodrom/2143835\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:163 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/kisela-voda/se-prodava-dupleks-vo-kisela-voda/8092122 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/kisela-voda/se-prodava-dupleks-vo-kisela-voda/8092122 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/kisela-voda/se-prodava-dupleks-vo-kisela-voda/8092122\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:164 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-kat-od-kuka-crnice/8078786 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-kat-od-kuka-crnice/8078786 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-kat-od-kuka-crnice/8078786\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:165 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-trosoben-stan-k-v/8079717 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-trosoben-stan-k-v/8079717 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-trosoben-stan-k-v/8079717\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:166 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-dvosoben-stan-kapistec/7846127 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-dvosoben-stan-kapistec/7846127 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-dvosoben-stan-kapistec/7846127\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:167 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-dvosoben-stan-k-v/7846139 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-dvosoben-stan-k-v/7846139 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-dvosoben-stan-k-v/7846139\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:168 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-moderno-ureden-stan-vo-aerodrom/8092099 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-moderno-ureden-stan-vo-aerodrom/8092099 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-moderno-ureden-stan-vo-aerodrom/8092099\n",
            "Upsert: 49/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:169 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/nov-dvosoben-vo-strog-centar-complex-diamond/5219256 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/nov-dvosoben-vo-strog-centar-complex-diamond/5219256 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/nov-dvosoben-vo-strog-centar-complex-diamond/5219256\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:171 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-izdava-stan-vo-kapishtecz-42m2-250e/7921616 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-izdava-stan-vo-kapishtecz-42m2-250e/7921616 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-izdava-stan-vo-kapishtecz-42m2-250e/7921616\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:172 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:173 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/kratok-prestoj-vo-centar-na-skopje/1871023 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/kratok-prestoj-vo-centar-na-skopje/1871023 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/kratok-prestoj-vo-centar-na-skopje/1871023\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:174 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-iznajmuva-stan-vo-centar-ramstore/7315064 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-iznajmuva-stan-vo-centar-ramstore/7315064 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/se-iznajmuva-stan-vo-centar-ramstore/7315064\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:175 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/izdavame-ubav-stan-vo-kapistec-kaj-katolicka/7613739 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/izdavame-ubav-stan-vo-kapistec-kaj-katolicka/7613739 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/skopje-opstina/izdavame-ubav-stan-vo-kapistec-kaj-katolicka/7613739\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:176 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/centar/kvaliteten-nov-trosoben-stan-vo-centar/1771710 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/centar/kvaliteten-nov-trosoben-stan-vo-centar/1771710 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/centar/kvaliteten-nov-trosoben-stan-vo-centar/1771710\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:177 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-vo-crnice/8092004 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-vo-crnice/8092004 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/kisela-voda/se-izdava-stan-vo-crnice/8092004\n",
            "Upsert: 58/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:178 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/karpos/se-izdava-stan-vo-taftalidze/8092003 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/karpos/se-izdava-stan-vo-taftalidze/8092003 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/karpos/se-izdava-stan-vo-taftalidze/8092003\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:179 final_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-vo-kapistec/8092001 meta_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-vo-kapistec/8092001 llm_url= https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/centar/se-izdava-stan-vo-kapistec/8092001\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:180 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/ohrid/ohrid-opstina/agh-elite-apartments-studios/4293606 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/ohrid/ohrid-opstina/agh-elite-apartments-studios/4293606 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/ohrid/ohrid-opstina/agh-elite-apartments-studios/4293606\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:181 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/partnerstvo-delovno-tehnicka-sorabotka/3570466 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/partnerstvo-delovno-tehnicka-sorabotka/3570466 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/partnerstvo-delovno-tehnicka-sorabotka/3570466\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:182 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/partnerstvo-delovno-tehnicka-sorabotka/3570466 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/partnerstvo-delovno-tehnicka-sorabotka/3570466 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/partnerstvo-delovno-tehnicka-sorabotka/3570466\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:183 final_url= https://goo.gl/maps/JCjWwdwi7Zov8d7R9 meta_url= None llm_url= https://goo.gl/maps/JCjWwdwi7Zov8d7R9\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:184 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:185 final_url= None meta_url= None llm_url= None\n",
            "Upsert: 66/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:186 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:187 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/vnimanie-se-izdavaat-25-sobi-so-zaednicki-prostorii-karpos/6113018 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/vnimanie-se-izdavaat-25-sobi-so-zaednicki-prostorii-karpos/6113018 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/vnimanie-se-izdavaat-25-sobi-so-zaednicki-prostorii-karpos/6113018\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:188 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:189 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/skopje-opstina/ubava-kukja-vo-bardovci/7910603 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/skopje-opstina/ubava-kukja-vo-bardovci/7910603 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/skopje-opstina/ubava-kukja-vo-bardovci/7910603\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:190 final_url= None meta_url= None llm_url= None\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:191 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/nova-nevseluvana-kukja-vo-kozle/7936568 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/nova-nevseluvana-kukja-vo-kozle/7936568 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/nova-nevseluvana-kukja-vo-kozle/7936568\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:192 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/samostojna-kukja-na-atraktivna-lokacija-vo-bardovci/7340053 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/samostojna-kukja-na-atraktivna-lokacija-vo-bardovci/7340053 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/samostojna-kukja-na-atraktivna-lokacija-vo-bardovci/7340053\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:193 final_url= http://www.impuls.com.mk/ meta_url= None llm_url= http://www.impuls.com.mk/\n",
            "Upsert: 74/75\n",
            "DEBUG ROW: 4:31a87c81-2f4b-48d2-92cc-cc57bcf130e9:194 final_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/centar/se-izdava-prazna-kukja-so-bazen-vo-crnice/8077262 meta_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/centar/se-izdava-prazna-kukja-so-bazen-vo-crnice/8077262 llm_url= https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/centar/se-izdava-prazna-kukja-so-bazen-vo-crnice/8077262\n",
            "Upsert: 75/75 (final)\n",
            "Graph upsert time: 319.55 s\n"
          ]
        }
      ],
      "source": [
        "assert _ensure_ollama_up(), \"Ollama not up\"\n",
        "with driver.session() as s:\n",
        "    print(s.run(\"MATCH (c:ChunkP3) WHERE c.extracted IS NULL OR c.extracted = false RETURN count(c) AS n\").data())\n",
        "\n",
        "sample = fetch_chunks_p3(limit=120)\n",
        "extract_and_upsert_p3(sample, batch_size=8)\n"
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Reinitialize на веќе постоечки граф\n",
        "from langchain_community.embeddings import OllamaEmbeddings\n",
        "from langchain_community.vectorstores import Neo4jVector\n",
        "from neo4j import GraphDatabase\n",
        "import pandas as pd, requests, json\n",
        "\n",
        "emb = OllamaEmbeddings(model=\"nomic-embed-text\", base_url=\"http://127.0.0.1:11434\")\n",
        "store = Neo4jVector.from_existing_graph(\n",
        "    embedding=emb,\n",
        "    url=NEO4J_URI,\n",
        "    username=NEO4J_USER,\n",
        "    password=NEO4J_PASS,\n",
        "    index_name=\"chunk_embed\",\n",
        "    node_label=\"Chunk\",\n",
        "    text_node_properties=[\"text\"],\n",
        "    embedding_node_property=\"embedding\",\n",
        ")\n",
        "\n",
        "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USER,NEO4J_PASS))"
      ],
      "metadata": {
        "id": "yKBJ_gTSTiyn"
      },
      "execution_count": 17,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "from langchain_community.vectorstores import Neo4jVector\n",
        "import pandas as pd\n",
        "import json, requests\n",
        "\n",
        "# re-attach на постоечкиот vector index\n",
        "store_p3 = Neo4jVector.from_existing_graph(\n",
        "    embedding=emb,\n",
        "    url=NEO4J_URI,\n",
        "    username=NEO4J_USER,\n",
        "    password=NEO4J_PASS,\n",
        "    index_name=\"chunk_embed_p3\",\n",
        "    node_label=\"ChunkP3\",\n",
        "    text_node_properties=[\"text\"],\n",
        "    embedding_node_property=\"embedding\",\n",
        ")\n",
        "\n",
        "def chunk_ids_for_hits_p3(hits):\n",
        "    \"\"\"\n",
        "    Од листа на vector hits извлечи chunkId.\n",
        "    Ако недостига во metadata, пробај да најдеш по text во графот (fallback).\n",
        "    \"\"\"\n",
        "    ids = [h.metadata.get(\"chunkId\") for h in hits if h.metadata.get(\"chunkId\")]\n",
        "    if len(ids) < len(hits):\n",
        "        with driver.session() as s:\n",
        "            for d in hits:\n",
        "                if d.metadata.get(\"chunkId\"):\n",
        "                    continue\n",
        "                row = s.run(\n",
        "                    \"MATCH (c:ChunkP3 {text:$t}) RETURN c.chunkId AS id LIMIT 1\",\n",
        "                    t=d.page_content\n",
        "                ).single()\n",
        "                if row and row[\"id\"]:\n",
        "                    ids.append(row[\"id\"])\n",
        "    return ids\n",
        "\n",
        "def graph_expand_from_chunk_ids_p3(ids, top=10):\n",
        "    \"\"\"\n",
        "    Од ChunkP3 → Listing + Location + Feature + Agent\n",
        "    Враќа rows со деталите за огласот.\n",
        "    \"\"\"\n",
        "    if not ids:\n",
        "        return []\n",
        "\n",
        "    q = \"\"\"\n",
        "    UNWIND $ids AS cid\n",
        "    MATCH (l:Listing)-[:MENTIONED_IN]->(c:ChunkP3 {chunkId: cid})\n",
        "    OPTIONAL MATCH (l)-[:LOCATED_IN]->(loc:Location)\n",
        "    OPTIONAL MATCH (l)-[:HAS_FEATURE]->(f:Feature)\n",
        "    OPTIONAL MATCH (l)-[:LISTED_BY]->(a:Agent)\n",
        "    WITH l, loc, collect(DISTINCT f.name) AS feats, a\n",
        "    RETURN\n",
        "      l.uid           AS uid,\n",
        "      l.title         AS title,\n",
        "      l.price_eur     AS price_eur,\n",
        "      l.price_period  AS price_period,\n",
        "      l.area_m2       AS area_m2,\n",
        "      l.rooms         AS rooms,\n",
        "      l.listing_type  AS listing_type,\n",
        "      l.property_type AS property_type,\n",
        "      coalesce(loc.name, '?') AS location,\n",
        "      loc.lat         AS lat,\n",
        "      loc.lon         AS lon,\n",
        "      feats           AS features,\n",
        "      coalesce(a.name, '?') AS agent,\n",
        "      a.phone         AS phone,\n",
        "      l.url           AS url\n",
        "    LIMIT $k\n",
        "    \"\"\"\n",
        "    with driver.session() as s:\n",
        "        return s.run(q, ids=ids, k=top).data()\n",
        "\n",
        "# ќе го користиме истиот модел како за останатото\n",
        "LLM_MODEL_ANS = LLM_MODEL\n",
        "\n",
        "def ollama_short(prompt, num_predict=220):\n",
        "    \"\"\"\n",
        "    Краток одговор од LLM (стриминг).\n",
        "    \"\"\"\n",
        "    r = requests.post(\n",
        "        f\"{BASE}/api/generate\",\n",
        "        json={\n",
        "            \"model\": LLM_MODEL_ANS,\n",
        "            \"prompt\": prompt,\n",
        "            \"stream\": True,\n",
        "            \"options\": {\"temperature\": 0.2, \"num_predict\": num_predict},\n",
        "        },\n",
        "        stream=True,\n",
        "        timeout=(10, 610),\n",
        "    )\n",
        "    r.raise_for_status()\n",
        "    out = []\n",
        "    for line in r.iter_lines(decode_unicode=True):\n",
        "        if not line:\n",
        "            continue\n",
        "        try:\n",
        "            obj = json.loads(line)\n",
        "            if \"response\" in obj:\n",
        "                out.append(obj[\"response\"])\n",
        "        except json.JSONDecodeError:\n",
        "            continue\n",
        "    return \"\".join(out)\n",
        "\n",
        "def ask_hybrid_p3(qtext, k_vec=12, k_listings=8):\n",
        "    \"\"\"\n",
        "    Hybrid RAG:\n",
        "      1) Vector search по ChunkP3\n",
        "      2) Graph expand до Listing/Location/Feature/Agent\n",
        "      3) LLM одговор базиран само на табелата + линкови\n",
        "    \"\"\"\n",
        "    # 1) Vector RAG\n",
        "    hits = store_p3.similarity_search(qtext, k=k_vec)\n",
        "    if not hits:\n",
        "        return \"Нема релевантни парчиња.\"\n",
        "\n",
        "    # 2) Graph RAG (expand)\n",
        "    cids = chunk_ids_for_hits_p3(hits)\n",
        "    rows = graph_expand_from_chunk_ids_p3(cids, top=k_listings)\n",
        "\n",
        "    # Ако графот сè уште е празен (нема Listing), користи само текст\n",
        "    if not rows:\n",
        "        ctx = \"\\n\\n\".join(\n",
        "            [f\"[{i+1}] {d.page_content}\" for i, d in enumerate(hits, 1)]\n",
        "        )\n",
        "        prompt = (\n",
        "            \"Одговори во детали ИСКЛУЧИВО од следниов текст на македонски:\\n\\n\"\n",
        "            f\"{ctx[:4000]}\"\n",
        "        )\n",
        "        return ollama_short(prompt)\n",
        "\n",
        "    # 3) Табела од огласи\n",
        "    df = pd.DataFrame(rows)\n",
        "    table_txt = df.to_string(index=False)[:3500]\n",
        "\n",
        "    # 4) Генерација листа на цитати (URL-ови)\n",
        "    cites = []\n",
        "    for i, d in enumerate(hits[:8], 1):\n",
        "        cid = d.metadata.get(\"chunkId\")\n",
        "        link = None\n",
        "\n",
        "        if cid:\n",
        "            with driver.session() as s:\n",
        "                row = s.run(\"\"\"\n",
        "                    MATCH (c:ChunkP3 {chunkId:$cid})\n",
        "                    OPTIONAL MATCH (l:Listing)-[:MENTIONED_IN]->(c)\n",
        "                    RETURN coalesce(l.url, c.url) AS linkOut\n",
        "                    LIMIT 1\n",
        "                \"\"\", cid=cid).single()\n",
        "            if row:\n",
        "                link = row[\"linkOut\"]\n",
        "\n",
        "        # fallback ако ни графот нема url\n",
        "        if not link:\n",
        "            link = (\n",
        "                d.metadata.get(\"source_url\")\n",
        "                or d.metadata.get(\"source_pdf\")\n",
        "            )\n",
        "\n",
        "        cites.append(f\"[{i}] {link if link else '(no link)'}\")\n",
        "\n",
        "    prompt = f\"\"\"Одговори на македонски, концизно но детално, ИСКЛУЧИВО од табелата и цитатите.\n",
        "\n",
        "ПРАШАЊЕ:\n",
        "{qtext}\n",
        "\n",
        "ТАБЕЛА (огласи):\n",
        "{table_txt}\n",
        "\n",
        "ЦИТАТИ (линкови кон огласите):\n",
        "{chr(10).join(cites)}\n",
        "\n",
        "Правила:\n",
        "- Прво објасни накратко што најде (колку огласи се релевантни).\n",
        "- Потоа наведи 2–5 најрелевантни опции со цена, локација, тип (стан/куќа), издавање/продажба.\n",
        "- Ако има features (Балкон / Тераса, Паркинг, Нова градба итн.), искористи ги.\n",
        "- На крај предложи кои огласи најмногу одговараат на барањето и зошто.\n",
        "\"\"\"\n",
        "\n",
        "    return ollama_short(prompt)\n"
      ],
      "metadata": {
        "id": "UmoLv6xFUWna"
      },
      "execution_count": 18,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "print(ask_hybrid_p3(\"Дај ми линк за стан за изнајмување во Аеродром\"))\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "hMy6CIPRmVXR",
        "outputId": "32e975c4-e07a-4ab7-d772-7b13a78499b0"
      },
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Најдено е 1 релевантен оглас за стан за изнајмување во Аеродром.\n",
            "\n",
            "**Релевантни опции:**\n",
            "\n",
            "1. **Оглас:** https://www.pazar3.mk//oglas/zivealista/stanovi/izdavanje/skopje/aerodrom/se-izdava-stan-aerodrom-82m2/8092167\n",
            "\t* Цена: 1700 €/месец\n",
            "\t* Локација: Аеродром\n",
            "\t* Тип: Стан\n",
            "\t* Издавање: Изнајмување\n",
            "\t* Features: Балкон, Паркинг\n",
            "2. **Оглас:** https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/aerodrom/hit-samostojna-ponova-kukja-vo-lisice/557458\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "import pandas as pd\n",
        "\n",
        "def hybrid_listing_urls(qtext, k_vec=12, k_listings=15):\n",
        "    \"\"\"\n",
        "    Користи embedding пребарување + граф за да ги најде огласите\n",
        "    и враќа ЛИСТА ОД УНИКАТНИ URL-ови (без LLM).\n",
        "    \"\"\"\n",
        "    # 1) Vector search по chunks\n",
        "    hits = store_p3.similarity_search(qtext, k=k_vec)\n",
        "    if not hits:\n",
        "        return []\n",
        "\n",
        "    # 2) Собери chunkId за погодените парчиња\n",
        "    cids = chunk_ids_for_hits_p3(hits)\n",
        "    if not cids:\n",
        "        return []\n",
        "\n",
        "    # 3) Прошири преку графот во Listing јазли\n",
        "    rows = graph_expand_from_chunk_ids_p3(cids, top=k_listings)\n",
        "    if not rows:\n",
        "        return []\n",
        "\n",
        "    # 4) Извади уникатни URL-ови\n",
        "    urls = []\n",
        "    for r in rows:\n",
        "        u = r.get(\"url\")\n",
        "        if u and u not in urls:\n",
        "            urls.append(u)\n",
        "    return urls\n",
        "\n",
        "\n",
        "def hybrid_listing_urls_with_details(qtext, k_vec=12, k_listings=15):\n",
        "    \"\"\"\n",
        "    Враќа (DataFrame, [url1, url2, ...]) за да имаш и детали и линкови.\n",
        "    \"\"\"\n",
        "    hits = store_p3.similarity_search(qtext, k=k_vec)\n",
        "    if not hits:\n",
        "        return pd.DataFrame(), []\n",
        "\n",
        "    cids = chunk_ids_for_hits_p3(hits)\n",
        "    rows = graph_expand_from_chunk_ids_p3(cids, top=k_listings)\n",
        "    if not rows:\n",
        "        return pd.DataFrame(), []\n",
        "\n",
        "    df = pd.DataFrame(rows)\n",
        "    urls = []\n",
        "    for r in rows:\n",
        "        u = r.get(\"url\")\n",
        "        if u and u not in urls:\n",
        "            urls.append(u)\n",
        "    return df, urls\n",
        "\n",
        "def ask_hybrid_links_p3(qtext, k_vec=12, k_listings=8):\n",
        "    \"\"\"\n",
        "    Користи ист pipeline како ask_hybrid_p3, но LLM мора да врати\n",
        "    само URL-ови (по еден во ред).\n",
        "    \"\"\"\n",
        "    hits = store_p3.similarity_search(qtext, k=k_vec)\n",
        "    if not hits:\n",
        "        return \"Нема релевантни парчиња.\"\n",
        "\n",
        "    cids = chunk_ids_for_hits_p3(hits)\n",
        "    rows = graph_expand_from_chunk_ids_p3(cids, top=k_listings)\n",
        "    if not rows:\n",
        "        return \"Нема погодени огласи во графот.\"\n",
        "\n",
        "    df = pd.DataFrame(rows)\n",
        "    table_txt = df.to_string(index=False)[:3000]\n",
        "\n",
        "    cites = []\n",
        "    for i, d in enumerate(hits[:8], 1):\n",
        "        cid = d.metadata.get(\"chunkId\")\n",
        "        link = None\n",
        "        if cid:\n",
        "            with driver.session() as s:\n",
        "                row = s.run(\"\"\"\n",
        "                    MATCH (c:ChunkP3 {chunkId:$cid})\n",
        "                    OPTIONAL MATCH (l:Listing)-[:MENTIONED_IN]->(c)\n",
        "                    RETURN coalesce(l.url, c.url) AS linkOut\n",
        "                    LIMIT 1\n",
        "                \"\"\", cid=cid).single()\n",
        "            if row:\n",
        "                link = row[\"linkOut\"]\n",
        "        if not link:\n",
        "            link = d.metadata.get(\"source_url\") or d.metadata.get(\"source_pdf\")\n",
        "        cites.append(f\"[{i}] {link if link else '(no link)'}\")\n",
        "\n",
        "    prompt = f\"\"\"Извади од табелата и од цитатите САМО URL адреси на огласите\n",
        "(на pazar3.mk или други релевантни страни) кои одговараат на барањето.\n",
        "\n",
        "ФОРМАТ НА ОДГОВОР:\n",
        "Врати само URL-ови, ПО ЕДЕН ВО РЕД, без дополнителен текст, без објаснување.\n",
        "\n",
        "ПРАШАЊЕ:\n",
        "{qtext}\n",
        "\n",
        "ТАБЕЛА:\n",
        "{table_txt}\n",
        "\n",
        "ЦИТАТИ:\n",
        "{chr(10).join(cites)}\n",
        "\"\"\"\n",
        "\n",
        "    return ollama_short(prompt, num_predict=200)\n"
      ],
      "metadata": {
        "id": "jGqhD15lmbDr"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "print(ask_hybrid_links_p3(\n",
        "    \"Дади ми огласи за станови за ИЗНАЈМУВАЊЕ во Центар \"\n",
        "    \"со Балкон / Тераса и Паркинг простор / Гаража.\"\n",
        "))\n",
        "\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "R0ndaC9VX9eS",
        "outputId": "2feaa7b7-6aa0-4851-8016-66f1098e6eb4"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/ohrid/ohrid-opstina/agenczi\n",
            "https://www.pazar3.mk//oglas/zivealista/kukji-vili/prodazba/skopje/aerodrom/hit-samostojna-ponova-kukja-vo-lisice/5574586\n",
            "https://www.pazar3.mk//oglas/zivealista/kukji-vili/izdavanje/skopje/karpos/nova-kukja-vo-karposh-zhdanec/7100697\n",
            "https://www.pazar3.mk//oglas/zivealista/stanovi/prodazba/skopje/aerodrom/se-prodava-stan-aerodrom-82m/8092167\n",
            "https://www.pazar3.mk//oglas/zivealista/k\n"
          ]
        }
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": [],
      "gpuType": "T4"
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    },
    "accelerator": "GPU"
  },
  "nbformat": 4,
  "nbformat_minor": 0
}